Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/fsl_flexspi.c
                        /* Adjust size by the amount processed. */
                        handle->dataSize -= (size_t)4U * i;

                        /* Write word un-aligned data into tx fifo. */
                        if (0x00U != handle->dataSize)
                        {
                            uint32_t tempVal = 0x00U;

                            for (uint32_t j = 0U; j < handle->dataSize; j++)
                            {
                                tempVal |= ((uint32_t)*handle->data++ << (8U * j));
                            }

                            base->TFDR[i] = tempVal;
                        }

                        handle->dataSize = 0;
                    }

                    /* Push a watermark level data into IP TX FIFO. */
                    base->INTR = (uint32_t)kFLEXSPI_IpTxFifoWatermarkEmptyFlag;
                }
            }
            else
            {
                /* Empty else */
            }

            if (0U != (status & (uint32_t)kFLEXSPI_IpCommandExecutionDoneFlag))
            {
                base->INTR = (uint32_t)kFLEXSPI_IpCommandExecutionDoneFlag;
                if (handle->dataSize > 0UL) /* In case of some data not read/write. */
                {
                    if (handle->state ==  kFLEXSPI_BusyRead)
                    {
                        /* Read word aligned data from rx fifo. */
                        for (i = 0U; i < (handle->dataSize / 4U); i++)
                        {
                            *(uint32_t *)(void *)handle->data = base->RFDR[i];
                            handle->data += 4U;
                        }

                        /* Adjust size by the amount processed. */
                        handle->dataSize -= (size_t)4U * i;

                        /* Read word un-aligned data from rx fifo. */
                        if (0x00U != handle->dataSize)
                        {
                            uint32_t tempVal = base->RFDR[i];

                            for (i = 0U; i < handle->dataSize; i++)
                            {
                                *handle->data++ = ((uint8_t)(tempVal >> (8U * i)) & 0xFFU);
                            }
                        }

                    }
                    else if (handle->state == kFLEXSPI_BusyWrite)
                    {
                        /* Write word aligned data into tx fifo. */
                        for (i = 0U; i < (handle->dataSize / 4U); i++)
                        {
                            base->TFDR[i] = *(uint32_t *)(void *)handle->data;
                            handle->data += 4U;
                        }

                        /* Adjust size by the amount processed. */
                        handle->dataSize -= (size_t)4U * i;

                        /* Write word un-aligned data into tx fifo. */
                        if (0x00U != handle->dataSize)
                        {
                            uint32_t tempVal = 0x00U;

                            for (uint32_t j = 0U; j < handle->dataSize; j++)
                            {
                                tempVal |= ((uint32_t)*handle->data++ << (8U * j));
                            }

                            base->TFDR[i] = tempVal;
                        }
                    }
                    handle->dataSize = 0;
                }

                /* Until now, all data should be read/write. */
                /* Abort transfer, reset state as Idle. */
                FLEXSPI_TransferAbort(base, handle);

                if (NULL != handle->completionCallback)
                {
                    handle->completionCallback(base, handle, kStatus_Success, handle->userData);
                }
            }
        }
    }
    else
    {
        /* Empty else */
    }
}

#if defined(FSL_DRIVER_TRANSFER_DOUBLE_WEAK_IRQ) && FSL_DRIVER_TRANSFER_DOUBLE_WEAK_IRQ
#if defined(FLEXSPI)
void FLEXSPI_DriverIRQHandler(void);
void FLEXSPI_DriverIRQHandler(void)
{
    s_flexspiIsr(FLEXSPI, s_flexspiHandle[0]);
    SDK_ISR_EXIT_BARRIER;
}
#endif

#if defined(FLEXSPI0)
void FLEXSPI0_DriverIRQHandler(void);
void FLEXSPI0_DriverIRQHandler(void)
{
    s_flexspiIsr(FLEXSPI0, s_flexspiHandle[0]);
    SDK_ISR_EXIT_BARRIER;
}
#endif
#if defined(FLEXSPI1)
void FLEXSPI1_DriverIRQHandler(void);
void FLEXSPI1_DriverIRQHandler(void)
{
    s_flexspiIsr(FLEXSPI1, s_flexspiHandle[1]);
    SDK_ISR_EXIT_BARRIER;
}
#endif
#if defined(FLEXSPI2)
void FLEXSPI2_DriverIRQHandler(void);
void FLEXSPI2_DriverIRQHandler(void)
{
    s_flexspiIsr(FLEXSPI2, s_flexspiHandle[2]);
    SDK_ISR_EXIT_BARRIER;
}
#endif

#if defined(LSIO__FLEXSPI0)
void LSIO_OCTASPI0_INT_DriverIRQHandler(void);
void LSIO_OCTASPI0_INT_DriverIRQHandler(void)
{
    s_flexspiIsr(LSIO__FLEXSPI0, s_flexspiHandle[0]);
    SDK_ISR_EXIT_BARRIER;
}
#endif
#if defined(LSIO__FLEXSPI1)
void LSIO_OCTASPI1_INT_DriverIRQHandler(void);
void LSIO_OCTASPI1_INT_DriverIRQHandler(void)
{
    s_flexspiIsr(LSIO__FLEXSPI1, s_flexspiHandle[1]);
    SDK_ISR_EXIT_BARRIER;
}
#endif

#if defined(FSL_FEATURE_FLEXSPI_HAS_SHARED_IRQ0_IRQ1) && FSL_FEATURE_FLEXSPI_HAS_SHARED_IRQ0_IRQ1

void FLEXSPI0_FLEXSPI1_DriverIRQHandler(void);
void FLEXSPI0_FLEXSPI1_DriverIRQHandler(void)
{
    /* If handle is registered, treat the transfer function is enabled. */
    if (NULL != s_flexspiHandle[0])
    {
        s_flexspiIsr(FLEXSPI0, s_flexspiHandle[0]);
    }
    if (NULL != s_flexspiHandle[1])
    {
        s_flexspiIsr(FLEXSPI1, s_flexspiHandle[1]);
    }
}
#endif

#endif
